Revit 2017 API
ElectricalSystem.PanelName Property
Returns the Panel name of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public string PanelName { get; }
Visual Basic
Public ReadOnly Property PanelName As String
	Get
Visual C++
public:
property String^ PanelName {
	String^ get ();
}
Remarks
This property is used to retrieve the Panel name of the Electrical System.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace